trunk/app/controllers/ad_requests_controller.rb

  def index
    ad_container = AdContainer.find_by_identity params[:app]
    logger.info "found container #{ad_container}"
    unless ad_container.active? and ad_container.party.is_valid_publisher?
      render :json=>{}, :status=>400
      return
    end

    last_req = AdRequest.where(:ad_container_id=>ad_container.id, :ip_address=>request.env['REMOTE_ADDR'], :size_code=>params[:size]).order('created_at desc').first
    logger.info "last req at #{last_req.created_at.to_i}, and 5 seconds before is #{(Time.now - 5.second).to_i}" if last_req

    if last_req and last_req.created_at.to_i > (Time.now - 5.second).to_i
      render :json=>{}, :status=>400
      return
    end
    size = params[:size]
    ad_request = AdRequest.create! :publisher=>ad_container.party, :ad_container => ad_container, :ip_address=>request.env['REMOTE_ADDR'], :size_code=>size
    show_control = find_advertisement ad_container
    ad_request.show_control = show_control
    ad_request.save!
---
SELECT `ad_containers`.* FROM `ad_containers` WHERE `ad_containers`.`identity` = 'RUSUMzh22nSEtl45KWgR' LIMIT 1
SELECT `ad_requests`.* FROM `ad_requests` WHERE `ad_requests`.`size_code` = 'banner' AND `ad_requests`.`ad_container_id` = 298258269 AND `ad_requests`.`ip_address` = '0.0.0.0' ORDER BY created_at desc LIMIT 1
INSERT INTO `ad_requests` (`pay_method_id`, `shown`, `advertisement_id`, `publisher_share_rate`, `unit_price`, `ad_owner_id`, `agent_id`, `request_date`, `fulfilled`, `updated_at`, `size_code`, `ip_address`, `agent_share_rate`, `campaign_id`, `publish_policy_id`, `publisher_id`, `ad_container_id`, `clicked`, `paid`, `created_at`) VALUES (NULL, 0, NULL, NULL, NULL, NULL, NULL, '2012-03-13', 0, '2012-03-13 09:36:10', 'banner', '0.0.0.0', NULL, NULL, NULL, 6, 298258269, 0, 0, '2012-03-13 09:36:10')
UPDATE `ad_containers` SET `request_count` = COALESCE(`request_count`, 0) + 1 WHERE `ad_containers`.`id` = 298258269
UPDATE `ad_requests` SET `pay_method_id` = 3, `advertisement_id` = 5, `publisher_share_rate` = 0.8, `unit_price` = 0.01, `ad_owner_id` = 8, `fulfilled` = 1, `updated_at` = '2012-03-13 09:36:10', `agent_share_rate` = 0.0, `campaign_id` = 3, `publish_policy_id` = 3 WHERE `ad_requests`.`id` = 980190963

  def shown
    ad_request = AdRequest.find params[:id]
---
SELECT `ad_requests`.* FROM `ad_requests` WHERE `ad_requests`.`id` = 980190967 LIMIT 1

      else
        conditions= self.and(exps).conditions
      end
      show_control = AdShowControl.find :first, :conditions=>conditions, :order=>'weight * rand() desc'
---
SELECT `ad_show_controls`.* FROM `ad_show_controls` WHERE ((begin <= '2012-03-13') and ((end is null) or (end >= '2012-03-13')) and (ad_format in ('icon_text','image')) and (channel_id = 417882964) and ((size_codes is null) or (size_codes like '%\'banner\'%')) and (not (advertisement_id = 7)) and (content_categories is null) and ((ad_containers is null) or (ad_containers like '%\'298258270\'%'))) ORDER BY weight * rand() desc LIMIT 1