trunk/app/controllers/admin/contracts_controller.rb

INSERT INTO `contracts` (`mobile_phone`, `expiration_processed`, `contact_person`, `created_at`, `start_from`, `business_type`, `share_rate_1`, `share_rate_2`, `party_id`, `updated_at`, `expired_at`) VALUES ('123456', 0, 'person', '2012-03-13 09:38:06', '2012-03-13', 2, NULL, NULL, 40, '2012-03-13 09:38:06', '2013-03-13')
---
  def create
    @contract = @party.contracts.build params[:contract]
    begin
      Contract.transaction do
        @contract.save!

SELECT `parties`.* FROM `parties` WHERE `parties`.`id` = 40 LIMIT 1
---
  def find_party
    @party = Party.find params[:party_id] if params[:party_id]