trunk/app/views/parties/_party.html.erb

SELECT `contracts`.* FROM `contracts` WHERE `contracts`.`business_type` = 2 AND (`contracts`.party_id = 5) LIMIT 1
---
<%
  @contract = party.contracts.where(:business_type => Contract::BUSINESS_TYPE_AD_OWNER).first

SELECT `members`.* FROM `members` WHERE `members`.`id` = 4 LIMIT 1
---
        <td><%= get_party_type party.party_type %></td>
	<td><% if party and party.sales_id %><%= link_to Member.find(party.sales_id).email, edit_party_path(party, :format=>:html) %><% end %></td>